# Форматує ціну у вигляді рядка з двома десятковими знаками та гривневим знаком
def format_price(price):  # Функція1 - формат ціни
    return f"{price:.2f} грн"


# Перевіряє наявність товарів у магазині, повертає словник з інформацією про доступність кожного товару
def check_availability(store, *items):  # Функція2 - чек наявності
    return {item: (item in store and store[item][1]) for item in items}


# Обробляє процес замовлення: перевіряє наявність товарів, розраховує загальну суму та виводить чек
def order(store):  # Функція3 - замовлення
    order = input("Введіть товари через пробіл: ").split() #розбиває рядок на частини по пробілах (за замовчуванням) і повертає список.
    check = check_availability(store, *order)  # Перевірка доступності всіх введених товарів
    unavailable = [item for item, available in check.items() if not available]  #Створення списку товарів, які недоступні (де available = False)

    if unavailable:
        print("Замовлення скасовано! Немає:", ", ".join(unavailable))  # join об'єднує в рядок через ", "
        return
# Ініціалізація змінної для підрахунку загальної суми
    total = 0
    print("Замовлення:")
    # Прохід по кожному товару в замовленні
    for item in order:
        price = store[item][0] # Отримання ціни товару (перший елемент списку)
        print(f"{item}: {format_price(price)}") # Вивід назви товару та його ціни
        total += price # Додавання ціни до загальної суми

    print("Загалом:", format_price(total)) # Вивід підсумкової суми замовлення


# Головна функція програми, яка керує основним циклом взаємодії з користувачем
def main():  # Функція4 - головна
    store = {"Стіл": [1599.99, True], "Стілець": [500.50, False], "Лампа": [400.50, False], "Шафа": [30199.99, True],
             "Диван": [5800.25, True]}

    while True: # Нескінченний цикл для постійної роботи програми
        choice = input("Оберіть дію (1 - Купити, 2 - Переглянути ціни):") # Запит вибору дії у користувача

        if choice == "1":
            order(store) # Виклик функції замовлення
        elif choice == "2":
            for item, (price, available) in store.items(): # Вивід всіх товарів з цінами та статусом доступності
                status = "+" if available else "-" # "+" для доступних, "-" для недоступних
                print(f"{item}: {format_price(price)} ({status})") 
        else:
            print("Непрописаний варіант!") # Повідомлення про невірний вибір


if __name__ == '__main__': # Умова, яка перевіряє, чи цей файл запущено напряму, а не імпортовано

    main() # Якщо файл запущено напряму - викликати головну функцію

